of222/tutorials/rheoEFoam/channelEDF/PowerLaw/NernstPlanck/0/psi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{

    inlet
    {
	type            cyclic;
    }
    
    outlet
    {
	type            cyclic;      
    }
    
    symmetry
    {
	type            symmetryPlane;    
    }
   
    walls
    {
	type            fixedValue;
	value           uniform -0.01;         
    }

    frontAndBack
    {
	type            empty;     
    }
    
}

// ************************************************************************* //
